## The Busiest period in Seatle
In this notebook,we calculated the busiest months for listings availability by exploring calendar.csv file.

### Read the Data

In [1]:
import pandas as pd
import numpy as np
data_calendar=pd.read_csv('calendar.csv')

In [2]:
data_calendar.head()

   listing_id        date available   price
0      241032  2016-01-04         t  $85.00
1      241032  2016-01-05         t  $85.00
2      241032  2016-01-06         f     NaN
3      241032  2016-01-07         f     NaN
4      241032  2016-01-08         f     NaN

### Data Preparation

In [3]:
#extract month from the original 'date' column
month=lambda string:string[string.find('-')+1:string.find('-')+3]
data_calendar['month']=data_calendar['date'].map(month)
data_calendar.head()

   listing_id        date available   price month
0      241032  2016-01-04         t  $85.00    01
1      241032  2016-01-05         t  $85.00    01
2      241032  2016-01-06         f     NaN    01
3      241032  2016-01-07         f     NaN    01
4      241032  2016-01-08         f     NaN    01

### Data Exploration

In [4]:
# The days in calendar.csv dataset
print ('The total lodgings in calendar dataset is ', data_calendar['listing_id'].count()/365)

The total lodgings in calendar dataset is  3818.0

We see that in Seattle the busiest months is December with average 22.8 days available . The January is the most unbusy month with average availability of 17days. Other months have average availability for 19-21days.

In [5]:
def removechar(string):
    '''
    INPUT:
    string - original string with characters will be removed 
    OUTPUT:
    num - the numerical dtype after removed the characters like '$','%' and ','
    
    Remove characters like  '$','%' and ',' in the original columns and transform 'object' type to 'int' type.
    '''
    num=None
    if str(string).find('$')>=0 :
        string1=str(string)[str(string).find('$')+1:str(string).find('.')]
        if string1.find(',')<0:
            num=int(string1)
        elif string1.find(',')>0:
            #print (string1)
            num=int(string1[0])*1000+int(string1[string.find(',')+1:])
            #print (num)
        return num
    
    elif str(string).find('%')>0:
        string1=str(string)[:str(string).find('%')]
        num=float(string1)/100    
    return num

In [6]:
data_calendar['pricecorr']=data_calendar['price'].map(removechar)
data_calendar['pricecorr']=data_calendar['pricecorr'].fillna(0)
data_calendar.head()

   listing_id        date available   price month  pricecorr
0      241032  2016-01-04         t  $85.00    01       85.0
1      241032  2016-01-05         t  $85.00    01       85.0
2      241032  2016-01-06         f     NaN    01        0.0
3      241032  2016-01-07         f     NaN    01        0.0
4      241032  2016-01-08         f     NaN    01        0.0

In [7]:
data_calendar1=data_calendar[data_calendar.available=='t'].copy()
monthlistings=data_calendar1.groupby(['month'])['listing_id'].count().sort_values(ascending=False)
print ('The number of average available days  in each month is \n',monthlistings/3818)
avgprice=data_calendar1.groupby(['month'])['pricecorr'].mean().sort_values()
print ('The average price of each month is\n',avgprice)

The number of average available days  in each month is
 month
12    22.802776
03    21.984809
10    21.591933
11    21.419591
05    20.945783
09    20.232059
06    20.231535
08    19.996595
04    19.915401
07    19.440021
02    19.204034
01    17.008119
Name: listing_id, dtype: float64
The average price of each month is
 month
01    122.912176
02    124.293927
03    128.644488
04    135.097005
11    135.468635
10    136.808741
12    137.038192
05    139.538183
09    143.095422
06    147.473137
08    150.584555
07    152.048341
Name: pricecorr, dtype: float64

### Conclusion: The best month for visiting Seattle is January , for the price is the lowest in a year. I suggest that booking earlier because the properties supply is lower than other months.